In [341]:
import plotly.express as px
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# Open Data CSV #####

In [342]:
test_titanic = pd.read_csv('test.csv')
gender_sub = pd.read_csv('gender_submission.csv')
train_titanic = pd.read_csv('train.csv')
test_titanic

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [343]:
train_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [344]:
train_titanic.Fare.isnull().sum()

0

# Del Columns and Remove NAN lines from Training Data

In [345]:
train_titanic = train_titanic.drop(['Name','Ticket','Cabin'], axis=1)
train_titanic = train_titanic.dropna(how='any', axis=0)
train_titanic

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,male,22.0,1,0,7.2500,S
1,2,1,1,female,38.0,1,0,71.2833,C
2,3,1,3,female,26.0,0,0,7.9250,S
3,4,1,1,female,35.0,1,0,53.1000,S
4,5,0,3,male,35.0,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
885,886,0,3,female,39.0,0,5,29.1250,Q
886,887,0,2,male,27.0,0,0,13.0000,S
887,888,1,1,female,19.0,0,0,30.0000,S
889,890,1,1,male,26.0,0,0,30.0000,C
890,891,0,3,male,32.0,0,0,7.7500,Q

# Check for NaN values in Testing Data

In [346]:
test_titanic.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

# Calculate the ageÂ´s mean to replace with NaN

In [347]:
mean = test_titanic['Age'].mean()

# Remove unnecessary columns and fill Nan with Age mean on Testing Data

In [348]:
test_titanic = test_titanic.drop(['Name','Ticket','Cabin'], axis=1)
test_titanic = test_titanic.fillna(mean)
test_titanic

     PassengerId  Pclass     Sex       Age  SibSp  Parch      Fare Embarked
0            892       3    male  34.50000      0      0    7.8292        Q
1            893       3  female  47.00000      1      0    7.0000        S
2            894       2    male  62.00000      0      0    9.6875        Q
3            895       3    male  27.00000      0      0    8.6625        S
4            896       3  female  22.00000      1      1   12.2875        S
..           ...     ...     ...       ...    ...    ...       ...      ...
413         1305       3    male  30.27259      0      0    8.0500        S
414         1306       1  female  39.00000      0      0  108.9000        C
415         1307       3    male  38.50000      0      0    7.2500        S
416         1308       3    male  30.27259      0      0    8.0500        S
417         1309       3    male  30.27259      1      1   22.3583        C

[418 rows x 8 columns]

# Change de column type

In [349]:
train_titanic = train_titanic.astype('object')
train_titanic[['Age','PassengerId','Fare']]=train_titanic[['Age','PassengerId','Fare']].astype('int')
train_titanic.dtypes

PassengerId     int32
Survived       object
Pclass         object
Sex            object
Age             int32
SibSp          object
Parch          object
Fare            int32
Embarked       object
dtype: object

In [350]:
test_titanic = test_titanic.astype('object')
test_titanic[['PassengerId','Age','Fare']]=test_titanic[['PassengerId','Age','Fare']].astype('int')
test_titanic.dtypes

PassengerId     int32
Pclass         object
Sex            object
Age             int32
SibSp          object
Parch          object
Fare            int32
Embarked       object
dtype: object

# converting categorical data into dummy or indicator variables (Training/Testing)

In [351]:
train_titanic = pd.get_dummies(train_titanic,drop_first=True)
train_titanic

C:\Users\Administrator\anaconda3\lib\site-packages\pandas\core\algorithms.py:798: FutureWarning:

In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)

,PassengerId,Age,Fare,Survived_1,Pclass_2,Pclass_3,Sex_male,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,Embarked_Q,Embarked_S
0,1,22,7,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,1
1,2,38,71,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0
2,3,26,7,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1
3,4,35,53,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1
4,5,35,8,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,39,29,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,1,0
886,887,27,13,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
887,888,19,30,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1
889,890,26,30,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
890,891,32,7,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,1,0

In [352]:
test_titanic = pd.get_dummies(test_titanic,drop_first=True)
test_titanic

C:\Users\Administrator\anaconda3\lib\site-packages\pandas\core\algorithms.py:798: FutureWarning:

In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)

,PassengerId,Age,Fare,Pclass_2,Pclass_3,Sex_male,SibSp_1,SibSp_2,SibSp_3,SibSp_4,...,SibSp_8,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,Parch_9,Embarked_Q,Embarked_S
0,892,34,7,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
1,893,47,7,0,1,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,1
2,894,62,9,1,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
3,895,27,8,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
4,896,22,12,0,1,0,1,0,0,0,...,0,1,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,30,8,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
414,1306,39,108,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
415,1307,38,7,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
416,1308,30,8,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
417,1309,30,22,0,1,1,1,0,0,0,...,0,1,0,0,0,0,0,0,0,0

# check number os columns in each data and remove two extra columns from testing

In [353]:
train_titanic.columns

Index(['PassengerId', 'Age', 'Fare', 'Survived_1', 'Pclass_2', 'Pclass_3',
       'Sex_male', 'SibSp_1', 'SibSp_2', 'SibSp_3', 'SibSp_4', 'SibSp_5',
       'Parch_1', 'Parch_2', 'Parch_3', 'Parch_4', 'Parch_5', 'Parch_6',
       'Embarked_Q', 'Embarked_S'],
      dtype='object')

In [354]:
test_titanic.columns

Index(['PassengerId', 'Age', 'Fare', 'Pclass_2', 'Pclass_3', 'Sex_male',
       'SibSp_1', 'SibSp_2', 'SibSp_3', 'SibSp_4', 'SibSp_5', 'SibSp_8',
       'Parch_1', 'Parch_2', 'Parch_3', 'Parch_4', 'Parch_5', 'Parch_6',
       'Parch_9', 'Embarked_Q', 'Embarked_S'],
      dtype='object')

In [355]:
test_titanic = test_titanic.drop(['SibSp_8','Parch_9'],axis=1)
test_titanic

,PassengerId,Age,Fare,Pclass_2,Pclass_3,Sex_male,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,Embarked_Q,Embarked_S
0,892,34,7,0,1,1,0,0,0,0,0,0,0,0,0,0,0,1,0
1,893,47,7,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,1
2,894,62,9,1,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0
3,895,27,8,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1
4,896,22,12,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,30,8,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1
414,1306,39,108,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
415,1307,38,7,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1
416,1308,30,8,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1
417,1309,30,22,0,1,1,1,0,0,0,0,1,0,0,0,0,0,0,0

# Machine Learning - Separate columns X,Y and training by using DecisionTreeClassifier

In [356]:
from sklearn.model_selection import train_test_split

y = train_titanic["Survived_1"]
x = train_titanic.drop("Survived_1", axis=1)

x_train, x_test, y_train, y_test = train_test_split(x,y, test_size=0.3)

In [357]:
from sklearn.tree import DecisionTreeClassifier

modelo_decisao = DecisionTreeClassifier()
modelo_decisao.fit(x,y)

DecisionTreeClassifier()

# Criating predict with testing data

In [358]:
previsao_classificacao = modelo_decisao.predict(test_titanic)

In [359]:
print(previsao_classificacao)

[0 0 0 1 0 0 0 0 0 0 0 0 1 0 1 1 0 1 1 0 0 0 1 0 1 0 1 1 1 0 0 0 1 0 1 1 1
 0 0 1 0 0 0 1 1 0 0 0 1 1 1 0 1 0 0 0 0 0 0 1 0 0 0 0 1 1 0 0 0 1 0 0 1 1
 1 1 0 1 0 0 1 0 1 0 0 0 0 0 0 1 0 0 0 0 1 0 1 0 0 0 1 0 0 0 0 0 1 0 0 0 0
 0 1 0 1 1 1 0 1 1 1 0 1 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0 1 0 0 1 0 0 0
 0 0 1 0 0 1 0 0 1 0 1 0 0 0 1 0 0 0 1 0 1 0 0 0 0 0 1 1 1 0 1 1 0 0 1 0 1
 0 1 0 0 0 0 0 0 0 1 0 1 0 0 1 0 1 1 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 1 0 1 0
 1 0 1 1 0 0 0 0 0 1 1 0 1 0 0 1 1 1 1 1 1 0 0 1 1 0 1 1 0 0 1 0 0 0 0 0 1
 0 0 0 1 0 0 0 1 0 1 0 1 0 1 0 0 1 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 1 0 0 1 0 0 0 1 0 0 0 0 1 1 0 1 0 0 0 1 1 0
 0 1 0 0 0 0 0 0 0 1 1 0 1 0 0 0 1 1 0 0 0 1 1 1 0 0 1 0 1 1 1 1 0 0 0 1 0
 0 1 0 0 1 1 0 0 0 0 0 0 1 0 0 1 0 0 1 1 1 1 0 0 0 1 0 1 0 0 1 0 1 0 1 1 0
 1 0 0 0 1 1 0 1 0 0 0]

# Subs the values from 0 to 1. The predicion generate results for sex Male and we are comparing with Female

In [360]:
# aux = len(previsao_classificacao)
# for x in range(aux):
#     if previsao_classificacao[x]==0:
#         previsao_classificacao[x]=1
#     elif previsao_classificacao[x]==1:
#         previsao_classificacao[x]=0

In [361]:
# print(previsao_classificacao)

# Creating Dataframe to compar the prediction with kaggle results.

In [362]:
tabela_comparar = pd.DataFrame()
tabela_comparar['previsao'] = previsao_classificacao
tabela_comparar['PassengerId_P']= test_titanic['PassengerId'].astype('int')
tabela_comparar['resultado'] = gender_sub['Survived']
tabela_comparar['PassengerId_R']=gender_sub['PassengerId']
tabela_comparar

     previsao  PassengerId_P  resultado  PassengerId_R
0           0            892          0            892
1           0            893          1            893
2           0            894          0            894
3           1            895          0            895
4           0            896          1            896
..        ...            ...        ...            ...
413         0           1305          0           1305
414         1           1306          1           1306
415         0           1307          0           1307
416         0           1308          0           1308
417         0           1309          0           1309

[418 rows x 4 columns]

In [363]:
tabela_comparar['previsao'].value_counts()

0    274
1    144
Name: previsao, dtype: int64

In [364]:
tabela_comparar['resultado'].value_counts()

0    266
1    152
Name: resultado, dtype: int64

In [365]:
submission = pd.DataFrame(tabela_comparar,columns=['PassengerId_P','previsao'])
submission

     PassengerId_P  previsao
0              892         0
1              893         0
2              894         0
3              895         1
4              896         0
..             ...       ...
413           1305         0
414           1306         1
415           1307         0
416           1308         0
417           1309         0

[418 rows x 2 columns]

In [366]:
submission = submission.rename(columns={'PassengerId_P': 'PassengerId', 'previsao':'Survived'})

In [367]:
submission.to_csv("submission.csv",index=False)